package com.zyascend.NoBoring.model;

import java.util.List;

/**
 * Created by Administrator on 2016/7/16.
 */
public class TextJokeResult {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":1535,"ret_code":0,"contentlist":[{"id":"57874dab6e36d9fcc8174eab","title":"晚上我拿着二胡没事在","text":"晚上我拿着二胡没事在公园里闭着眼睛拉二胡。 这时走过来几个漂亮的妹子：卧槽，这男的长的这么帅，可惜是个瞎子，要不我就追他了！","type":1,"ct":"2016-07-14 16:30:35.487"},{"id":"57873f946e36d9fcc8171e77","title":"一美女同事抱怨自己穿","text":"一美女同事抱怨自己穿丝袜总是脱丝，此话一出，好几个女同事纷纷表示也有此困扰。 过了一会，一位学理科的哥们说话了：按照材料力学，丝袜容易脱丝主要是受到的张力过大，产生了塑性形变，通俗的说，就是腿粗。","type":1,"ct":"2016-07-14 15:30:28.525"},{"id":"57873f946e36d9fcc8171e74","text":"<p> 1、自从老爸学会了用微信，一家人都在里面。他每天早上六点准时发红包！你要敢抢马上打电话叫你起床！不说了该起床了！ <\/p> <p> 2、我：妈。我要和一女的出去约会。<p><\/p> 妈：好嘞。这一千块钱拿去。大方点<p><\/p> 到约定地点，微信对方：宝贝儿快来。<p><\/p> 随后只见一熟悉身影飘来，靠近一看，是我老爸！！？<p><\/p> 我：爸，你怎么来了，咋知道我在这儿？<p><\/p> 爸：傻小子，快把你的钱拿出来分我一半，半个月不知道烟是什么味了。<p><\/p> 我：不，我还要和我网友约会呢！<p><\/p> 爸：别傻了，那女的微信号是我小号加你的。<p><\/p>......","title":"生活技能高超的爆笑老爸","type":1,"ct":"2016-07-14 15:30:28.511"},{"id":"57873f946e36d9fcc8171e73","text":"<p> 1、昨晚去女同事家吃饭，她妈表现地极度热情，一直夸自己的女儿多孝顺、多懂事、多持家，说要是谁娶了她女儿绝对好福气，末了突然话锋一转，问我：\u201c天太晚了，你要不就在这过夜吧？\u201d<p><\/p> 我听着耳畔传来的《新闻联播》片头曲不禁陷入沉思。。。 <\/p> <p> 2、去年春节和老爸一起贴对联。。。<p><\/p> 一个福字被我贴歪了，我爸说歪福(wife)，这预示明年要娶媳妇了！<p><\/p> 好吧老爸，你赢了！ <\/p> <p> 3、早上我跟在厨房里做早餐的爸爸说：\u201c爸爸从今天开始，我本命年，你是不是送我个红色的礼物。\u201d<p><\/p>......","title":"总能笑场的爆逗爸妈","type":1,"ct":"2016-07-14 15:30:28.478"},{"id":"57873f946e36d9fcc8171e72","text":"<p> 1、今天老爸语重心长的给我说，家族的兴旺以后就靠你了，我现在把家族的企业交给你，你要好好努力，不要辜负我对你的期望。<p><\/p> 听了老父亲的话，我握紧手中的锄头，用坚定的眼神看着父亲，我以后会好好刨地的。 <\/p> <p> 2、妈妈叮嘱女儿，有三种男人不能嫁：一种是喷香水的；一种是爱嚼口香糖的；一种是穿拖鞋的。<p><\/p> 女儿愣着想不通这是为什么，这时候，爸爸嚼着口香糖，穿着拖鞋，从旁边路过，还留下阵阵香气。 <\/p> <p> 3、小时候，每次在电视看排球比赛，我和我爸就赌穿什么颜色衣服的姑娘会赢，奇怪我每次都输给我爸。<p><\/p>......","title":"老爸和老妈,把你乐开花","type":1,"ct":"2016-07-14 15:30:28.477"},{"id":"57873f946e36d9fcc8171e71","text":"<p> 1、从小看电视就羡慕电视剧里别人家的冰箱，天啊什么都有，饮料，啤酒，炸鸡鸭脖各种各样。<p><\/p> 回头看看自己家的冰箱，剩菜剩饭辣椒酱。。。 <\/p> <p> 2、每天开老爸的扣扣号来斗地主，希望他某天能赢个三五十万的欢乐豆，让他知道这是儿子孝顺他的。<p><\/p> 但是往往事与愿违，今天又接到电话了：\u201c败家仔！你个败家仔！我三个号的豆你都输光了！ \u201d <\/p> <p> 3、吃饭的时候的事。家里炒的芹菜，我爸吃了一口看着买回芹菜的我妈说：\u201c这芹菜真老，卖菜的是看买菜的年龄给的菜吧。\u201d<p><\/p> 我妈顿时瞪过去。。。<p><\/p>......","title":"家庭笑事多,老少皆幽默","type":1,"ct":"2016-07-14 15:30:28.477"},{"id":"578738746e36d9fcc816fb9e","title":"地理课上，一女生不听","text":"地理课上，一女生不听讲，在底下化妆，老师走到面前说：你能用两个地名描述下你的脸吗？ 女同学想了半天也没想出来，看着老师，老师说：大连，太原。","type":1,"ct":"2016-07-14 15:00:04.652"},{"id":"578738746e36d9fcc816fb9d","title":"当总有傻逼对你说：\u201c","text":"当总有傻逼对你说：\u201c脑子是个好东西，希望你有。\u201d 你应该这么回答：\u201c不是所有的脑子都是好东西，比如你的。\u201d","type":1,"ct":"2016-07-14 15:00:04.652"},{"id":"57872a636e36d9fcc816cabb","title":"A：听说哪里有胎记就","text":"A：听说哪里有胎记就是你上辈子怎么死的，比如手腕有痣就是割腕自杀的。 B：我屁股上有一个。","type":1,"ct":"2016-07-14 14:00:03.595"},{"id":"57870e446e36d9fcc8166c68","text":"<p> 1、老爸今天生日，刚给老爸电话没打通，给老妈打：\u201c妈，你老公怎么不接我电话！ \u201d<p><\/p> \u201c因为我老公家教严，不随便接别的女人的电话！ \u201d <\/p> <p> 2、爸爸：玩了一天饿不饿啊？<p><\/p> 女儿：有点儿。<p><\/p> 爸爸：你妈很快就回来做饭了。 <\/p> <p> 3、跟妹子讲我玩过蹦极，妹子一副很崇拜的样子，其实真实的情况是，我哭着喊着不敢跳，我亲爹亲手把我推下去的，还喊道：钱都交了，不跳多浪费。。。 <\/p> <p> 4、孩子一岁，那天我看他蹲在床上使劲，我一个箭步过去，眼看粑粑都出来了，一咬牙，伸手接住了，好险，差点洗床单！ <\/p> <p> 5、撒谎被老妈知道了，老妈对我说：\u201c我是一个讲道理的人，不随便打人，我给你讲讲为什么不能撒谎，你听过狼来了的故事吗？\u201d<p><\/p>......","title":"笑你面瘫的爆笑爸妈","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c67","text":"<p> 1、我大叫：\u201c妈，你做的小鸡炖蘑菇怎么没有鸡肉？\u201d<p><\/p> 爸大叫：\u201c老婆，红烧牛肉怎么没有牛肉。\u201d<p><\/p> 一个声音从厨房传来：\u201c闭嘴，好好吃你们的方便面！ \u201d <\/p> <p> 2、和我妈妈打电话，谈到我的工作有点小情绪了。。。<p><\/p> 妈妈电话里安慰说\u201c你是全世界最好的女孩，开心点。\u201d<p><\/p> 我说妈妈你加个看字再说一遍，电话那边停顿了下说：\u201c看，你是全世界最好的女孩，开心点。\u201d<p><\/p> 我。。。 <\/p> <p> 3、老妈挂电话神速，我经常支支吾吾准备讲下一句的时候就挂了。今天回家和老妈抱怨挂电话能不能不要这么快啊，有时候话还没说完呢就挂了！<p><\/p>......","title":"他(她)们有个幽默的逗妈","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c66","text":"<p> 1、火车上，一男子买了肯德基给孩子吃，孩子只吃了两口就不吃了。。。<p><\/p> 爸爸问儿子：回去吃好不好？<p><\/p> 儿子说：好啊，回去给妈妈吃。<p><\/p> 此男子拿起鸡腿就啃了起来，边啃边念念有词：老子带你这么辛苦，你给妈妈吃！！！ <\/p> <p> 2、\u201c爸爸，你一个穷屌丝是怎么追到我白富美妈妈的？\u201d<p><\/p> \u201c多亏一个人给了我无声但是有力的支持啊！ \u201d<p><\/p> \u201c谁啊？\u201d<p><\/p> \u201c你啊！ \u201d <\/p> <p> 3、考试得了0分，老妈看后大发脾气，说你这傻逼，这辈子也就这样了，不会有出息了！<p><\/p> 老爸听到后，马上对老妈说：小孩是要鼓励的，不能骂！<p><\/p>......","title":"爆囧,笑瞎眼的二货爹","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c64","text":"<p> 1、出去玩儿，忽然下起了冰雹，躲闪不急额头上被砸了好几个包，回到家我妈就问：是不是又和人打架了？<p><\/p> 我：没有，这是天打的。<p><\/p> 我妈：你杂不说是雷劈的？ <\/p> <p> 2、晚上和我妈吵嘴，一狠心就说了句：我不吃饭了！<p><\/p> 谁知老妈来句：饭可以不吃，但锅必须得刷。。。<p><\/p> 顿时感觉这日子没法过了。。。 <\/p> <p> 3、老妈在做饭中：儿子，你去给我拿个那啥！<p><\/p> 我：啥？<p><\/p> 老妈：那啥啊，就在那个哪儿放着呢！！<p><\/p> 我：啥啊？在哪？<p><\/p> 老妈：算了，我自己拿，你说说你，啥也找不见，除了吃还会干啥！！<p><\/p>......","title":"爆囧雷妈,这日子没法过了","type":1,"ct":"2016-07-14 12:00:04.948"},{"id":"57870e446e36d9fcc8166c63","text":"<p> 1、妈妈：多吃点儿。<p><\/p> 儿子：从圣诞节到元旦我都吃胖了。<p><\/p> 妈妈：让你变胖的不是圣诞节到元旦之间吃的，而是元旦到圣诞节之间吃的。 <\/p> <p> 2、和妈妈去逛街，我：\u201c妈妈，天快黑了，我们快点走。\u201d<p><\/p> 我妈：\u201c你是太阳能的吗？\u201d<p><\/p> 我。。。 <\/p> <p> 3、去姨家，发现姨夫对姨殷勤备至，各种腻歪。<p><\/p> 又见表哥一人坐沙发上发呆，便过去问他。<p><\/p> 表哥看了我一眼，叹了口气说：\u201c你要明白，我家已经开始正式实施二孩政策了。\u201d <\/p> <p> 4、老爸说我不孝，自己以后死了一分钱都不分给我。<p><\/p>......","title":"笑哭子女的醉人爸妈","type":1,"ct":"2016-07-14 12:00:04.948"},{"id":"578707566e366c93cc69e5a9","title":"有次和爸妈开玩笑说：","text":"有次和爸妈开玩笑说：我是你们充费送的吧！ 爸妈神回复道：傻孩纸，别开玩笑了，要是充费送的，我们就要豆油了，还能要你！","type":1,"ct":"2016-07-14 11:30:30.648"},{"id":"578707566e366c93cc69e5a7","text":"<p> 1、昨晚和妈妈一起睡觉，我撒娇：\u201c妈，给我讲个故事吧，睡不着。\u201d<p><\/p> 老妈：\u201c从前有个小白兔，不叠被子不做饭，不洗衣服不找男友，这么大还一直花她妈妈的钱。。。\u201d<p><\/p> \u201c行了妈，我有点困了，先睡了。\u201d <\/p> <p> 2、今天早上还在熟睡，被一阵香气惊醒。然后就看到我妈在屋子里拿着空气清新剂在喷。<p><\/p> 便问\u201c妈你干嘛？\u201d<p><\/p> 老妈：\u201c没事，清新下空气，满屋子单身狗的味！ \u201d<p><\/p> 说完了便转身就走了。 <\/p> <p> 3、到家第一件事就是马上向老妈扑通一声跪下。<p><\/p> \u201c妈，我没交到女朋友！ \u201d<p><\/p>......","title":"把人笑晕的雷人老妈","type":1,"ct":"2016-07-14 11:30:30.456"},{"id":"578707566e366c93cc69e5a5","text":"<p> 1、我妈不让我把头发扎起来，说像刘欢。<p><\/p> 我说那我披着吧，她说也不行，像腾格尔。<p><\/p> 怒了我说剃光总行了吧？！她说还是不行像郭德纲！ <\/p> <p> 2、我妈经常这样批评我：\u201c你看你垃圾桶里怎么这么多垃圾。\u201d<p><\/p> \u201c洗衣机里怎么全是脏衣服！ \u201d<p><\/p> \u201c怎么你每次洗完澡厕所里都是水！ \u201d <\/p> <p> 3、带儿子出去玩，儿子太顽劣，旁边的人说他是个没家教的孩子，我听了很生气：\u201c你为什么说他没家教？\u201d<p><\/p> 那人：\u201c我说了咋的？你是他父亲吧？我连你一起说！ \u201d<p><\/p> 我一看不对，赶紧回答：\u201c不是，我就是这孩子他爸请的家教。\u201d <\/p> <p> 4、发了一条朋友圈：我真是日了狗了。<p><\/p>......","title":"爆逗,有爸有妈有笑颜","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a3","text":"<p> 1、老妈要装假牙，女儿和儿子为了谁给老妈付费的问题吵了起来。<p><\/p> 最终，老妈拍板，姐弟俩一人出一半。<p><\/p> 不料，假牙装好没几天，老妈就觉得牙有些不舒服。<p><\/p> 这时，老爸在一旁说：\u201c当初我就让你不要花孩子们的钱，你偏不听！这闺女和儿子从小就爱闹别扭，现在你这上牙听闺女的，下牙听儿子的，协调性肯定差。\u201d <\/p> <p> 2、和老爸老妈在客厅看电视，老爸突然问了句：宝贝，中午吃什么？<p><\/p> 我随口回答，水煮鱼。。。<p><\/p> 我爸悠悠来了句：滚一边去，我问你妈呢！<p><\/p> 我。。。 <\/p> <p> 3、和媳妇说好了，为了家庭和谐。<p><\/p>......","title":"爸妈特别逗,开心一家人","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a2","text":"<p> 1、超市碰到老妈同事，她说你女儿真好看，比你年轻那会都好看，我妈悠悠的来了一句：那怎么我有老公，她就没有呢？ <\/p> <p> 2、爸爸说：\u201c你看别人家长都逼婚，我们不逼婚，我们就是关心下你。。。你有女朋友了吗？\u201d <\/p> <p> 3、我妈见我回家的第一反应是：\u201c唉，算命的给我说，你会带着女朋友回来的啊！ \u201d <\/p> <p> 4、以前老妈老说，要学会独立，不要靠父母。现在变成了，你能不能不要那么独立，赶紧找个对象靠靠？ <\/p> <p> 5、最尴尬的其实是像我这种已到适婚还未到晚婚的年纪，父母着急又不好意思明着逼你，只好说：\u201c愿女儿在新的一年不再孤单！ \u201d <\/p> <p> 6、老妈：\u201c起床了，起床了。\u201d<p><\/p>......","title":"过年,父母变着法儿把婚逼","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a1","text":"<p> 1、去年情人节 回家路上看见卖甘蔗的，想吃就买了一根，到家碰见我妈出来遛狗，我妈说：人家姑娘都领个男朋友抱束花，你再看看你，拎着个金箍棒像个猴儿似的。。。\u201d <\/p> <p> 2、老爸曾经告诉我：\u201c长的好看的呢，我们就夸她漂亮；长的不好看的呢，我们就夸她有气质。而你呢？\u201d用怜悯的眼神打量了我一下，说：\u201c算是个善良的孩子了。\u201d <\/p> <p> 3、今天坐公交，看见一对父女，女儿边哭边说：\u201c爸爸，我好丑。。。\u201d<p><\/p> 父亲温柔地说：\u201c不哭，你在丑也是爸爸的女儿。\u201d<p><\/p> 我听后心里五味杂陈，连忙给老爸发去短信：\u201c爸，我好丑！ \u201d<p><\/p>......","title":"搞笑的是父母也有很二的","type":1,"ct":"2016-07-14 11:30:30.452"}],"currentPage":3,"allNum":30694,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    /**
     * allPages : 1535
     * ret_code : 0
     * contentlist : [{"id":"57874dab6e36d9fcc8174eab","title":"晚上我拿着二胡没事在","text":"晚上我拿着二胡没事在公园里闭着眼睛拉二胡。 这时走过来几个漂亮的妹子：卧槽，这男的长的这么帅，可惜是个瞎子，要不我就追他了！","type":1,"ct":"2016-07-14 16:30:35.487"},{"id":"57873f946e36d9fcc8171e77","title":"一美女同事抱怨自己穿","text":"一美女同事抱怨自己穿丝袜总是脱丝，此话一出，好几个女同事纷纷表示也有此困扰。 过了一会，一位学理科的哥们说话了：按照材料力学，丝袜容易脱丝主要是受到的张力过大，产生了塑性形变，通俗的说，就是腿粗。","type":1,"ct":"2016-07-14 15:30:28.525"},{"id":"57873f946e36d9fcc8171e74","text":"<p> 1、自从老爸学会了用微信，一家人都在里面。他每天早上六点准时发红包！你要敢抢马上打电话叫你起床！不说了该起床了！ <\/p> <p> 2、我：妈。我要和一女的出去约会。<p><\/p> 妈：好嘞。这一千块钱拿去。大方点<p><\/p> 到约定地点，微信对方：宝贝儿快来。<p><\/p> 随后只见一熟悉身影飘来，靠近一看，是我老爸！！？<p><\/p> 我：爸，你怎么来了，咋知道我在这儿？<p><\/p> 爸：傻小子，快把你的钱拿出来分我一半，半个月不知道烟是什么味了。<p><\/p> 我：不，我还要和我网友约会呢！<p><\/p> 爸：别傻了，那女的微信号是我小号加你的。<p><\/p>......","title":"生活技能高超的爆笑老爸","type":1,"ct":"2016-07-14 15:30:28.511"},{"id":"57873f946e36d9fcc8171e73","text":"<p> 1、昨晚去女同事家吃饭，她妈表现地极度热情，一直夸自己的女儿多孝顺、多懂事、多持家，说要是谁娶了她女儿绝对好福气，末了突然话锋一转，问我：\u201c天太晚了，你要不就在这过夜吧？\u201d<p><\/p> 我听着耳畔传来的《新闻联播》片头曲不禁陷入沉思。。。 <\/p> <p> 2、去年春节和老爸一起贴对联。。。<p><\/p> 一个福字被我贴歪了，我爸说歪福(wife)，这预示明年要娶媳妇了！<p><\/p> 好吧老爸，你赢了！ <\/p> <p> 3、早上我跟在厨房里做早餐的爸爸说：\u201c爸爸从今天开始，我本命年，你是不是送我个红色的礼物。\u201d<p><\/p>......","title":"总能笑场的爆逗爸妈","type":1,"ct":"2016-07-14 15:30:28.478"},{"id":"57873f946e36d9fcc8171e72","text":"<p> 1、今天老爸语重心长的给我说，家族的兴旺以后就靠你了，我现在把家族的企业交给你，你要好好努力，不要辜负我对你的期望。<p><\/p> 听了老父亲的话，我握紧手中的锄头，用坚定的眼神看着父亲，我以后会好好刨地的。 <\/p> <p> 2、妈妈叮嘱女儿，有三种男人不能嫁：一种是喷香水的；一种是爱嚼口香糖的；一种是穿拖鞋的。<p><\/p> 女儿愣着想不通这是为什么，这时候，爸爸嚼着口香糖，穿着拖鞋，从旁边路过，还留下阵阵香气。 <\/p> <p> 3、小时候，每次在电视看排球比赛，我和我爸就赌穿什么颜色衣服的姑娘会赢，奇怪我每次都输给我爸。<p><\/p>......","title":"老爸和老妈,把你乐开花","type":1,"ct":"2016-07-14 15:30:28.477"},{"id":"57873f946e36d9fcc8171e71","text":"<p> 1、从小看电视就羡慕电视剧里别人家的冰箱，天啊什么都有，饮料，啤酒，炸鸡鸭脖各种各样。<p><\/p> 回头看看自己家的冰箱，剩菜剩饭辣椒酱。。。 <\/p> <p> 2、每天开老爸的扣扣号来斗地主，希望他某天能赢个三五十万的欢乐豆，让他知道这是儿子孝顺他的。<p><\/p> 但是往往事与愿违，今天又接到电话了：\u201c败家仔！你个败家仔！我三个号的豆你都输光了！ \u201d <\/p> <p> 3、吃饭的时候的事。家里炒的芹菜，我爸吃了一口看着买回芹菜的我妈说：\u201c这芹菜真老，卖菜的是看买菜的年龄给的菜吧。\u201d<p><\/p> 我妈顿时瞪过去。。。<p><\/p>......","title":"家庭笑事多,老少皆幽默","type":1,"ct":"2016-07-14 15:30:28.477"},{"id":"578738746e36d9fcc816fb9e","title":"地理课上，一女生不听","text":"地理课上，一女生不听讲，在底下化妆，老师走到面前说：你能用两个地名描述下你的脸吗？ 女同学想了半天也没想出来，看着老师，老师说：大连，太原。","type":1,"ct":"2016-07-14 15:00:04.652"},{"id":"578738746e36d9fcc816fb9d","title":"当总有傻逼对你说：\u201c","text":"当总有傻逼对你说：\u201c脑子是个好东西，希望你有。\u201d 你应该这么回答：\u201c不是所有的脑子都是好东西，比如你的。\u201d","type":1,"ct":"2016-07-14 15:00:04.652"},{"id":"57872a636e36d9fcc816cabb","title":"A：听说哪里有胎记就","text":"A：听说哪里有胎记就是你上辈子怎么死的，比如手腕有痣就是割腕自杀的。 B：我屁股上有一个。","type":1,"ct":"2016-07-14 14:00:03.595"},{"id":"57870e446e36d9fcc8166c68","text":"<p> 1、老爸今天生日，刚给老爸电话没打通，给老妈打：\u201c妈，你老公怎么不接我电话！ \u201d<p><\/p> \u201c因为我老公家教严，不随便接别的女人的电话！ \u201d <\/p> <p> 2、爸爸：玩了一天饿不饿啊？<p><\/p> 女儿：有点儿。<p><\/p> 爸爸：你妈很快就回来做饭了。 <\/p> <p> 3、跟妹子讲我玩过蹦极，妹子一副很崇拜的样子，其实真实的情况是，我哭着喊着不敢跳，我亲爹亲手把我推下去的，还喊道：钱都交了，不跳多浪费。。。 <\/p> <p> 4、孩子一岁，那天我看他蹲在床上使劲，我一个箭步过去，眼看粑粑都出来了，一咬牙，伸手接住了，好险，差点洗床单！ <\/p> <p> 5、撒谎被老妈知道了，老妈对我说：\u201c我是一个讲道理的人，不随便打人，我给你讲讲为什么不能撒谎，你听过狼来了的故事吗？\u201d<p><\/p>......","title":"笑你面瘫的爆笑爸妈","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c67","text":"<p> 1、我大叫：\u201c妈，你做的小鸡炖蘑菇怎么没有鸡肉？\u201d<p><\/p> 爸大叫：\u201c老婆，红烧牛肉怎么没有牛肉。\u201d<p><\/p> 一个声音从厨房传来：\u201c闭嘴，好好吃你们的方便面！ \u201d <\/p> <p> 2、和我妈妈打电话，谈到我的工作有点小情绪了。。。<p><\/p> 妈妈电话里安慰说\u201c你是全世界最好的女孩，开心点。\u201d<p><\/p> 我说妈妈你加个看字再说一遍，电话那边停顿了下说：\u201c看，你是全世界最好的女孩，开心点。\u201d<p><\/p> 我。。。 <\/p> <p> 3、老妈挂电话神速，我经常支支吾吾准备讲下一句的时候就挂了。今天回家和老妈抱怨挂电话能不能不要这么快啊，有时候话还没说完呢就挂了！<p><\/p>......","title":"他(她)们有个幽默的逗妈","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c66","text":"<p> 1、火车上，一男子买了肯德基给孩子吃，孩子只吃了两口就不吃了。。。<p><\/p> 爸爸问儿子：回去吃好不好？<p><\/p> 儿子说：好啊，回去给妈妈吃。<p><\/p> 此男子拿起鸡腿就啃了起来，边啃边念念有词：老子带你这么辛苦，你给妈妈吃！！！ <\/p> <p> 2、\u201c爸爸，你一个穷屌丝是怎么追到我白富美妈妈的？\u201d<p><\/p> \u201c多亏一个人给了我无声但是有力的支持啊！ \u201d<p><\/p> \u201c谁啊？\u201d<p><\/p> \u201c你啊！ \u201d <\/p> <p> 3、考试得了0分，老妈看后大发脾气，说你这傻逼，这辈子也就这样了，不会有出息了！<p><\/p> 老爸听到后，马上对老妈说：小孩是要鼓励的，不能骂！<p><\/p>......","title":"爆囧,笑瞎眼的二货爹","type":1,"ct":"2016-07-14 12:00:04.950"},{"id":"57870e446e36d9fcc8166c64","text":"<p> 1、出去玩儿，忽然下起了冰雹，躲闪不急额头上被砸了好几个包，回到家我妈就问：是不是又和人打架了？<p><\/p> 我：没有，这是天打的。<p><\/p> 我妈：你杂不说是雷劈的？ <\/p> <p> 2、晚上和我妈吵嘴，一狠心就说了句：我不吃饭了！<p><\/p> 谁知老妈来句：饭可以不吃，但锅必须得刷。。。<p><\/p> 顿时感觉这日子没法过了。。。 <\/p> <p> 3、老妈在做饭中：儿子，你去给我拿个那啥！<p><\/p> 我：啥？<p><\/p> 老妈：那啥啊，就在那个哪儿放着呢！！<p><\/p> 我：啥啊？在哪？<p><\/p> 老妈：算了，我自己拿，你说说你，啥也找不见，除了吃还会干啥！！<p><\/p>......","title":"爆囧雷妈,这日子没法过了","type":1,"ct":"2016-07-14 12:00:04.948"},{"id":"57870e446e36d9fcc8166c63","text":"<p> 1、妈妈：多吃点儿。<p><\/p> 儿子：从圣诞节到元旦我都吃胖了。<p><\/p> 妈妈：让你变胖的不是圣诞节到元旦之间吃的，而是元旦到圣诞节之间吃的。 <\/p> <p> 2、和妈妈去逛街，我：\u201c妈妈，天快黑了，我们快点走。\u201d<p><\/p> 我妈：\u201c你是太阳能的吗？\u201d<p><\/p> 我。。。 <\/p> <p> 3、去姨家，发现姨夫对姨殷勤备至，各种腻歪。<p><\/p> 又见表哥一人坐沙发上发呆，便过去问他。<p><\/p> 表哥看了我一眼，叹了口气说：\u201c你要明白，我家已经开始正式实施二孩政策了。\u201d <\/p> <p> 4、老爸说我不孝，自己以后死了一分钱都不分给我。<p><\/p>......","title":"笑哭子女的醉人爸妈","type":1,"ct":"2016-07-14 12:00:04.948"},{"id":"578707566e366c93cc69e5a9","title":"有次和爸妈开玩笑说：","text":"有次和爸妈开玩笑说：我是你们充费送的吧！ 爸妈神回复道：傻孩纸，别开玩笑了，要是充费送的，我们就要豆油了，还能要你！","type":1,"ct":"2016-07-14 11:30:30.648"},{"id":"578707566e366c93cc69e5a7","text":"<p> 1、昨晚和妈妈一起睡觉，我撒娇：\u201c妈，给我讲个故事吧，睡不着。\u201d<p><\/p> 老妈：\u201c从前有个小白兔，不叠被子不做饭，不洗衣服不找男友，这么大还一直花她妈妈的钱。。。\u201d<p><\/p> \u201c行了妈，我有点困了，先睡了。\u201d <\/p> <p> 2、今天早上还在熟睡，被一阵香气惊醒。然后就看到我妈在屋子里拿着空气清新剂在喷。<p><\/p> 便问\u201c妈你干嘛？\u201d<p><\/p> 老妈：\u201c没事，清新下空气，满屋子单身狗的味！ \u201d<p><\/p> 说完了便转身就走了。 <\/p> <p> 3、到家第一件事就是马上向老妈扑通一声跪下。<p><\/p> \u201c妈，我没交到女朋友！ \u201d<p><\/p>......","title":"把人笑晕的雷人老妈","type":1,"ct":"2016-07-14 11:30:30.456"},{"id":"578707566e366c93cc69e5a5","text":"<p> 1、我妈不让我把头发扎起来，说像刘欢。<p><\/p> 我说那我披着吧，她说也不行，像腾格尔。<p><\/p> 怒了我说剃光总行了吧？！她说还是不行像郭德纲！ <\/p> <p> 2、我妈经常这样批评我：\u201c你看你垃圾桶里怎么这么多垃圾。\u201d<p><\/p> \u201c洗衣机里怎么全是脏衣服！ \u201d<p><\/p> \u201c怎么你每次洗完澡厕所里都是水！ \u201d <\/p> <p> 3、带儿子出去玩，儿子太顽劣，旁边的人说他是个没家教的孩子，我听了很生气：\u201c你为什么说他没家教？\u201d<p><\/p> 那人：\u201c我说了咋的？你是他父亲吧？我连你一起说！ \u201d<p><\/p> 我一看不对，赶紧回答：\u201c不是，我就是这孩子他爸请的家教。\u201d <\/p> <p> 4、发了一条朋友圈：我真是日了狗了。<p><\/p>......","title":"爆逗,有爸有妈有笑颜","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a3","text":"<p> 1、老妈要装假牙，女儿和儿子为了谁给老妈付费的问题吵了起来。<p><\/p> 最终，老妈拍板，姐弟俩一人出一半。<p><\/p> 不料，假牙装好没几天，老妈就觉得牙有些不舒服。<p><\/p> 这时，老爸在一旁说：\u201c当初我就让你不要花孩子们的钱，你偏不听！这闺女和儿子从小就爱闹别扭，现在你这上牙听闺女的，下牙听儿子的，协调性肯定差。\u201d <\/p> <p> 2、和老爸老妈在客厅看电视，老爸突然问了句：宝贝，中午吃什么？<p><\/p> 我随口回答，水煮鱼。。。<p><\/p> 我爸悠悠来了句：滚一边去，我问你妈呢！<p><\/p> 我。。。 <\/p> <p> 3、和媳妇说好了，为了家庭和谐。<p><\/p>......","title":"爸妈特别逗,开心一家人","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a2","text":"<p> 1、超市碰到老妈同事，她说你女儿真好看，比你年轻那会都好看，我妈悠悠的来了一句：那怎么我有老公，她就没有呢？ <\/p> <p> 2、爸爸说：\u201c你看别人家长都逼婚，我们不逼婚，我们就是关心下你。。。你有女朋友了吗？\u201d <\/p> <p> 3、我妈见我回家的第一反应是：\u201c唉，算命的给我说，你会带着女朋友回来的啊！ \u201d <\/p> <p> 4、以前老妈老说，要学会独立，不要靠父母。现在变成了，你能不能不要那么独立，赶紧找个对象靠靠？ <\/p> <p> 5、最尴尬的其实是像我这种已到适婚还未到晚婚的年纪，父母着急又不好意思明着逼你，只好说：\u201c愿女儿在新的一年不再孤单！ \u201d <\/p> <p> 6、老妈：\u201c起床了，起床了。\u201d<p><\/p>......","title":"过年,父母变着法儿把婚逼","type":1,"ct":"2016-07-14 11:30:30.452"},{"id":"578707566e366c93cc69e5a1","text":"<p> 1、去年情人节 回家路上看见卖甘蔗的，想吃就买了一根，到家碰见我妈出来遛狗，我妈说：人家姑娘都领个男朋友抱束花，你再看看你，拎着个金箍棒像个猴儿似的。。。\u201d <\/p> <p> 2、老爸曾经告诉我：\u201c长的好看的呢，我们就夸她漂亮；长的不好看的呢，我们就夸她有气质。而你呢？\u201d用怜悯的眼神打量了我一下，说：\u201c算是个善良的孩子了。\u201d <\/p> <p> 3、今天坐公交，看见一对父女，女儿边哭边说：\u201c爸爸，我好丑。。。\u201d<p><\/p> 父亲温柔地说：\u201c不哭，你在丑也是爸爸的女儿。\u201d<p><\/p> 我听后心里五味杂陈，连忙给老爸发去短信：\u201c爸，我好丑！ \u201d<p><\/p>......","title":"搞笑的是父母也有很二的","type":1,"ct":"2016-07-14 11:30:30.452"}]
     * currentPage : 3
     * allNum : 30694
     * maxResult : 20
     */

    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        /**
         * id : 57874dab6e36d9fcc8174eab
         * title : 晚上我拿着二胡没事在
         * text : 晚上我拿着二胡没事在公园里闭着眼睛拉二胡。 这时走过来几个漂亮的妹子：卧槽，这男的长的这么帅，可惜是个瞎子，要不我就追他了！
         * type : 1
         * ct : 2016-07-14 16:30:35.487
         */

        private List<TextJoke> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<TextJoke> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<TextJoke> contentlist) {
            this.contentlist = contentlist;
        }

        public static class TextJoke {

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public TextJoke(String id, String text, String ct) {
                this.id = id;
                this.text = text;
                this.ct = ct;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }
        }
    }
}
